УНФ_ТЕСТ/src/Catalogs/ТарифныеПланыДоговоровОбслуживания/ТарифныеПланыДоговоровОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифныеПланыДоговоровОбслуживания</name>
  <attributes>
    <name>НезапланированныеЗатратыВключатьВСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеЗатратыЗапрещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеЗатратыПредставлениеВСчете</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеЗатратыФормированиеЦены</name>
    <type>
      <types>EnumRef.БиллингФормированиеЦеныЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеЗатратыНаценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеЗатратыФиксированнаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеПозицииВключатьВСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеПозицииЗапрещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезапланированныеПозицииПредставлениеВСчете</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетЗатрат</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьВСчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормированиеЦены</name>
      <type>
        <types>EnumRef.БиллингФормированиеЦеныЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВСчете</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПериодВСодержание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьВСчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормированиеЦены</name>
      <type>
        <types>EnumRef.БиллингФормированиеЦеныНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВСчете</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПериодВСодержание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Enums/БиллингФормированиеЦеныЗатрат/БиллингФормированиеЦеныЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БиллингФормированиеЦеныЗатрат</name>
  <enumValues>
    <name>ПоСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоСебестоимостиСНаценкой</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/БиллингФормированиеЦеныНоменклатуры/БиллингФормированиеЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БиллингФормированиеЦеныНоменклатуры</name>
  <enumValues>
    <name>ПоВидуЦенДоговора</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/ТарифныеПланыДоговоровОбслуживания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НезапланированныеЗатратыВключатьВСчет Тогда
		ПроверяемыеРеквизиты.Добавить("НезапланированныеЗатратыПредставлениеВСчете");
		
		Если НезапланированныеЗатратыФормированиеЦены = Перечисления.БиллингФормированиеЦеныЗатрат.ФиксированноеЗначение Тогда
			ПроверяемыеРеквизиты.Добавить("НезапланированныеЗатратыФиксированнаяЦена");
		ИначеЕсли НезапланированныеЗатратыФормированиеЦены = Перечисления.БиллингФормированиеЦеныЗатрат.ПоСебестоимостиСНаценкой Тогда
			ПроверяемыеРеквизиты.Добавить("НезапланированныеЗатратыНаценка");
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Стр Из УчетНоменклатуры Цикл
		Если Стр.ФормированиеЦены = Перечисления.БиллингФормированиеЦеныНоменклатуры.ФиксированноеЗначение
			И НЕ ЗначениеЗаполнено(Стр.Цена) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не заполнена колонка ""Цена"" в строке %1 списка ""Номенклатура"".'"),
				Стр.НомерСтроки
			);
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"УчетНоменклатуры",
				Стр.НомерСтроки,
				"ПредставлениеЦены",
				Отказ
			);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр Из УчетЗатрат Цикл
		
		Если Стр.ФормированиеЦены = Перечисления.БиллингФормированиеЦеныЗатрат.ФиксированноеЗначение
			И НЕ ЗначениеЗаполнено(Стр.Цена) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не заполнена колонка ""Цена"" в строке %1 списка ""Затраты"".'"),
				Стр.НомерСтроки
			);
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"УчетЗатрат",
				Стр.НомерСтроки,
				"ПредставлениеЦены",
				Отказ
			);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
